docs/mediciones/perf/k6-console-auth-cold-run3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-cold-run3.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.6s/30s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.6s/30s

running (0m04.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  02.6s/30s

running (0m05.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.6s/30s

running (0m06.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.6s/30s

running (0m07.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  05.6s/30s

running (0m08.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.6s/30s

running (0m09.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.6s/30s

running (0m10.0s), 50/50 VUs, 399 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  08.6s/30s

running (0m11.0s), 50/50 VUs, 433 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.6s/30s

running (0m12.0s), 50/50 VUs, 463 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.6s/30s

running (0m13.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  11.6s/30s

running (0m14.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.6s/30s

running (0m15.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.6s/30s

running (0m16.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  14.6s/30s

running (0m17.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.6s/30s

running (0m18.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.6s/30s

running (0m19.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  17.6s/30s

running (0m20.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.6s/30s

running (0m21.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.6s/30s

running (0m22.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  20.6s/30s

running (0m23.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.6s/30s

running (0m24.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.6s/30s

running (0m25.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  23.6s/30s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.6s/30s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.6s/30s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  26.6s/30s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.6s/30s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.6s/30s

running (0m31.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  29.6s/30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 2900 out of 2900
     data_received..................: 1.3 MB  40 kB/s
     data_sent......................: 1.5 MB  47 kB/s
     http_req_blocked...............: avg=31.31µs min=1.97µs  med=9.85µs   max=7.32ms  p(90)=25.98µs p(95)=61.46µs 
     http_req_connecting............: avg=8.63µs  min=0s      med=0s       max=5.41ms  p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=46.32ms min=10.87ms med=37.85ms  max=1.09s   p(90)=73.11ms p(95)=86.8ms  
       { expected_response:true }...: avg=46.32ms min=10.87ms med=37.85ms  max=1.09s   p(90)=73.11ms p(95)=86.8ms  
   ✓ http_req_failed................: 0.00%   0 out of 1453
     http_req_receiving.............: avg=1.35ms  min=31.51µs med=786.07µs max=34.41ms p(90)=2.77ms  p(95)=4.14ms  
     http_req_sending...............: avg=64.49µs min=5.65µs  med=32.82µs  max=5.54ms  p(90)=97.8µs  p(95)=150.48µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=44.91ms min=10.17ms med=36.62ms  max=1.09s   p(90)=71.53ms p(95)=85.21ms 
     http_reqs......................: 1453    45.731735/s
     iteration_duration.............: avg=1.04s   min=1.01s   med=1.03s    max=1.25s   p(90)=1.07s   p(95)=1.08s   
     iterations.....................: 1450    45.637313/s
     vus............................: 50      min=0            max=50
     vus_max........................: 50      min=50           max=50


running (0m31.8s), 00/50 VUs, 1450 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s