docs/mediciones/perf/k6-console-auth-cold-run4.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-cold-run4.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.5s/30s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.5s/30s

running (0m04.0s), 50/50 VUs, 89 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.5s/30s

running (0m05.0s), 50/50 VUs, 121 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.5s/30s

running (0m06.0s), 50/50 VUs, 168 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.5s/30s

running (0m07.0s), 50/50 VUs, 218 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  05.5s/30s

running (0m08.0s), 50/50 VUs, 268 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.5s/30s

running (0m09.0s), 50/50 VUs, 316 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.5s/30s

running (0m10.0s), 50/50 VUs, 366 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  08.5s/30s

running (0m11.0s), 50/50 VUs, 413 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.5s/30s

running (0m12.0s), 50/50 VUs, 461 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.5s/30s

running (0m13.0s), 50/50 VUs, 511 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  11.5s/30s

running (0m14.0s), 50/50 VUs, 557 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.5s/30s

running (0m15.0s), 50/50 VUs, 606 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.5s/30s

running (0m16.0s), 50/50 VUs, 655 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  14.5s/30s

running (0m17.0s), 50/50 VUs, 705 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.5s/30s

running (0m18.0s), 50/50 VUs, 754 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.5s/30s

running (0m19.0s), 50/50 VUs, 801 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  17.5s/30s

running (0m20.0s), 50/50 VUs, 851 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.5s/30s

running (0m21.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.5s/30s

running (0m22.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  20.5s/30s

running (0m23.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.5s/30s

running (0m24.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.5s/30s

running (0m25.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  23.5s/30s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.5s/30s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.5s/30s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  26.5s/30s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.5s/30s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.5s/30s

running (0m31.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  29.5s/30s

running (0m32.0s), 30/50 VUs, 1450 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 2960 out of 2960
     data_received..................: 1.3 MB  40 kB/s
     data_sent......................: 1.5 MB  47 kB/s
     http_req_blocked...............: avg=19.02µs  min=2.01µs  med=7.66µs   max=1.7ms   p(90)=16.39µs p(95)=32.58µs 
     http_req_connecting............: avg=6.56µs   min=0s      med=0s       max=1ms     p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=30.88ms  min=5.51ms  med=13.17ms  max=1.25s   p(90)=62.68ms p(95)=165.89ms
       { expected_response:true }...: avg=30.88ms  min=5.51ms  med=13.17ms  max=1.25s   p(90)=62.68ms p(95)=165.89ms
   ✓ http_req_failed................: 0.00%   0 out of 1483
     http_req_receiving.............: avg=898.02µs min=40.59µs med=408.28µs max=31.58ms p(90)=1.53ms  p(95)=2.7ms   
     http_req_sending...............: avg=43.73µs  min=5.28µs  med=25.62µs  max=1.58ms  p(90)=79.86µs p(95)=111.05µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=29.93ms  min=5.26ms  med=12.63ms  max=1.25s   p(90)=61.24ms p(95)=162.69ms
     http_reqs......................: 1483    45.6372/s
     iteration_duration.............: avg=1.03s    min=1s      med=1.01s    max=1.29s   p(90)=1.06s   p(95)=1.16s   
     iterations.....................: 1480    45.54488/s
     vus............................: 30      min=0            max=50
     vus_max........................: 50      min=50           max=50


running (0m32.5s), 00/50 VUs, 1480 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s